Revit 2027 API
BuiltInFailures.StairRampFailures.WinderTooManyStartParallelTreadsOrRunWidthFailure Property
 The number of parallel treads at start is too great or the run width is too great.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId WinderTooManyStartParallelTreadsOrRunWidthFailure { get; }
Public Shared ReadOnly Property WinderTooManyStartParallelTreadsOrRunWidthFailure As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ WinderTooManyStartParallelTreadsOrRunWidthFailure {
	FailureDefinitionId^ get ();
}
static member WinderTooManyStartParallelTreadsOrRunWidthFailure : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace